Repository: ellie-commons/sequeler
Catalog: po/extra/*.po
Languages: it

source: SQL Client
it: Client SQL

source: Easily connect to your local or remote database
it: Connettiti facilmente al tuo database locale o remoto

source: Friendly SQL Client
it: Client SQL intuitivo

source: Store your Database Connections in the library, connect over SSH tunnel, type and execute SQL commands directly in the app, and do everything you need to do without the necessity of opening the terminal.
it: Salva le tue connessioni al database nella libreria, connettiti tramite tunnel SSH, digita ed esegui comandi SQL direttamente nell'app e fai tutto ciò che ti serve senza la necessità di aprire il terminale.

source: Supported Databases:
it: Database supportati:

source: Features Include:
it: Le funzionalità includono:

source: Test Connections before saving them
it: Verifica le connessioni prima di salvarle

source: View Table structure, content, and relations
it: Visualizza la struttura, il contenuto e le relazioni delle tabelle

source: Write multiple custom SQL Queries
it: Scrivi più query SQL personalizzate

source: Switch between light and dark mode
it: Passa dalla modalità chiara alla modalità scura

source: Handy keyboard shortcuts to quit (ctrl+q), create new connection (ctrl+shift+n), open a new window (ctrl+n)
it: Comode scorciatoie da tastiera per uscire (ctrl+q), creare una nuova connessione (ctrl+shift+n), aprire una nuova finestra (ctrl+n)

source: Fix translations are not loaded in Flatpak
it: Correzione: le traduzioni non vengono caricate in Flatpak

source: Modernize the UI to fall in line with modern desktop environments
it: Modernizza l'interfaccia utente per allinearla agli ambienti desktop moderni

source: Update Flatpak platform runtime and modules
it: Aggiorna il runtime e i moduli della piattaforma Flatpak

source: Update translations
it: Aggiorna le traduzioni

source: Odin release
it: Rilascio Odin

source: Update elementary OS Platform runtime.
it: Aggiorna il runtime della piattaforma elementary OS.

source: Update screenshots.
it: Aggiorna gli screenshot.

source: Updated translations for Ukranian, Russian, Indonisian, Chinese, Lithuanian, Portugese, Turkish, and Arabic.
it: Traduzioni aggiornate per ucraino, russo, indonesiano, cinese, lituano, portoghese, turco e arabo.

source: New Features
it: Nuove Funzionalità

source: Create, Edit, and Delete databases.
it: Crea, modifica ed elimina database.

source: New context menu to copy and edit tables.
it: Nuovo menu contestuale per copiare e modificare le tabelle.

source: Support unencrypted connections.
it: Supporto per connessioni non crittografate.

source: Bug Fixes
it: Correzioni di Bug

source: Fix copy column data.
it: Correzione: copia dei dati delle colonne.

source: Translations
it: Traduzioni

source: Updated translations for Ukranian, Russian, French, and German.
it: Traduzioni aggiornate per ucraino, russo, francese e tedesco.

source: Reduced CPU usage by 2%.
it: Ridotto l'utilizzo della CPU del 2%.

source: Update translations for Italian, Spanish, Catalan, French, Hindi, Russian, and Turkish.
it: Aggiornate le traduzioni per italiano, spagnolo, catalano, francese, hindi, russo e turco.

source: More fixes!
it: Altre correzioni!

source: 0.7.8 changelog
it: Registro delle modifiche 0.7.8

source: Fixed usage attempt of wrong Vala method.
it: Corretto il tentativo di utilizzo di un metodo Vala errato.

source: 0.7.7 changelog
it: Registro delle modifiche 0.7.7

source: Fix nasty GSettings bug causing the app to crash.
it: Corretto un fastidioso bug di GSettings che causava l'arresto anomalo dell'app.

source: Implement GDA Placeholder statement.
it: Implementata l'istruzione GDA Placeholder.

source: Improve Query Tab iconography.
it: Migliorata l'iconografia della scheda Query.

source: 0.7.6 changelog
it: Registro delle modifiche 0.7.6

source: Fix ORDER BY in PostgreSQL Relationship view.
it: Corretto ORDER BY nella vista delle relazioni di PostgreSQL.

source: Improve MySQL structure view.
it: Migliorata la visualizzazione della struttura MySQL.

source: Drop Granite.Settings in favour of GLib.Settings.
it: Rimossa Granite.Settings a favore di GLib.Settings.

source: Implement Granite.Notebook on the Query tab.
it: Implementato Granite.Notebook nella scheda Query.

source: Show query error messages inline.
it: Mostra i messaggi di errore delle query in linea.

source: Because 0.7.6 never happened!
it: Perché la 0.7.6 non è mai esistita!

source: Query Tab Bonanza!
it: Abbondanza di novità nella scheda Query!

source: New features and improvements
it: Nuove funzionalità e miglioramenti

source: You can now duplicate connections.
it: Ora puoi duplicare le connessioni.

source: Sorting columns now works as expected by actually running the ORDER BY query.
it: L'ordinamento delle colonne ora funziona come previsto eseguendo effettivamente la query ORDER BY.

source: Quickly jump to a specific result page with the handy dandy pagination popover.
it: Salta rapidamente a una pagina di risultati specifica con il pratico popover di paginazione.

source: Show Comment Column inside table structure view.
it: Mostra la colonna Commento all'interno della visualizzazione della struttura della tabella.

source: The 2020 release!
it: Il rilascio del 2020!

source: Manually reorder saved connection.
it: Riordina manualmente le connessioni salvate.

source: Allow selecting a custom SSH public key.
it: Consenti la selezione di una chiave pubblica SSH personalizzata.

source: Fix SSH tunnel crashes.
it: Correzione: arresti anomali del tunnel SSH.

source: Raw Query Improvements
it: Miglioramenti alle query grezze

source: Strip comments from SQL raw queries.
it: Rimuovi i commenti dalle query SQL grezze.

source: Better handle complex queries on multiple lines.
it: Gestione migliorata delle query complesse su più righe.

source: Speed up query rendering.
it: Velocizza il rendering delle query.

source: Sweet Query Tab Improvements
it: Dolci miglioramenti alla scheda Query

source: Edit font size of the Query Tab.
it: Modifica la dimensione del carattere della scheda Query.

source: Edit background style of the Query Tab.
it: Modifica lo stile dello sfondo della scheda Query.

source: Save and remember the Query Tab size.
it: Salva e ricorda le dimensioni della scheda Query.

source: PostgreSQL Fixes
it: Correzioni PostgreSQL

source: Fixed PostgreSQL relationship table.
it: Corretta la tabella delle relazioni di PostgreSQL.

source: Fixed wrong response message when handling non select queries.
it: Corretto il messaggio di risposta errato quando si gestiscono query non selezionata.

source: Bite-Size fixes
it: Correzioni a piccole dosi

source: Removed unused libfixposix.
it: Rimossa libfixposix inutilizzata.

source: Fixed pagination issue when clicking too fast while fetching big data.
it: Corretto il problema di paginazione quando si clicca troppo velocemente durante il recupero di big data.

source: Bug fixes and improvements
it: Correzioni di bug e miglioramenti

source: Rewritten pagination to use LIMIT and OFFSET.
it: Riscritta la paginazione per utilizzare LIMIT e OFFSET.

source: Faster pagination and content viewing for big data.
it: Paginazione e visualizzazione dei contenuti più veloci per i big data.

source: Show records count in table's list.
it: Mostra il conteggio dei record nell'elenco delle tabelle.

source: Bug fixes and other improvements.
it: Correzioni di bug e altri miglioramenti.

source: Properly handle EXPLAIN SQL statement.
it: Gestisce correttamente l'istruzione EXPLAIN SQL.

source: Properly handle querying capitlized PostgreSQL tables.
it: Gestisce correttamente l'interrogazione di tabelle PostgreSQL con nomi in maiuscolo.

source: Improved async methods for internal views.
it: Metodi asincroni migliorati per le viste interne.

source: Updated translations.
it: Traduzioni aggiornate.

source: Critical bug fix!
it: Correzione di bug critica!

source: CRITICAL: Fixes missing GSettings Schema, restore lost connections.
it: CRITICO: Corregge lo schema GSettings mancante, ripristina le connessioni perse.

source: Other small bug fixes and improvements.
it: Altre piccole correzioni di bug e miglioramenti.

source: Implemented SSH tunneling
it: Implementato il tunneling SSH

source: WARNING: This release packs many updates and something could break. Please, backup your connections.
it: ATTENZIONE: questa versione include molti aggiornamenti e qualcosa potrebbe rompersi. Si prega di eseguire il backup delle connessioni.

source: Connect via SSH to a remote Database.
it: Connettiti tramite SSH a un database remoto.

source: Major code refactor to handle UI updates via async methods.
it: Importante refactoring del codice per gestire gli aggiornamenti dell'interfaccia utente tramite metodi asincroni.

source: Use Stack container to show a loading Spinner during fetch or data processing methods.
it: Utilizza il contenitore Stack per mostrare un indicatore di caricamento durante i metodi di recupero o elaborazione dei dati.

source: Major performance improvements to the table search and dropdown schema switcher.
it: Importanti miglioramenti delle prestazioni nella ricerca delle tabelle e nello switcher dello schema a discesa.

source: Fancy New Icon!
it: Nuova icona elegante!

source: New fancy Icon.
it: Nuova icona elegante.

source: Use GtkNativeDialog.
it: Utilizza GtkNativeDialog.

source: Bug fixes and Improvements.
it: Correzioni di bug e miglioramenti.

source: Open SQLite files
it: Apri file SQLite

source: Open SQLite files directly in Sequeler.
it: Apri i file SQLite direttamente in Sequeler.

source: Right click to copy data inside a column.
it: Fai clic con il pulsante destro del mouse per copiare i dati all'interno di una colonna.

source: UI Fixes and Performance Improvements
it: Correzioni dell'interfaccia utente e miglioramenti delle prestazioni

source: UI fix for logout button.
it: Correzione dell'interfaccia utente per il pulsante di disconnessione.

source: View shortcuts on preferences dropdown.
it: Visualizza le scorciatoie nel menu a tendina delle preferenze.

source: Performance Improvements.
it: Miglioramenti delle prestazioni.

source: Italian translation.
it: Traduzione italiana.

source: Export all the things!
it: Esporta tutte le cose!

source: Export results from Query Tab.
it: Esporta i risultati dalla scheda Query.

source: Export in CSV or Plain Text format.
it: Esporta in formato CSV o Testo semplice.

source: Sort Columns order everywhere.
it: Ordina l'ordine delle colonne ovunque.

source: Brazilian translation.
it: Traduzione brasiliana.

source: Here comes the power of Pagination!!!
it: Ecco che arriva la potenza della paginazione!!!

source: Paginate results in the Content tab.
it: Pagina i risultati nella scheda Contenuto.

source: Query messages UI improvements.
it: Miglioramenti all'interfaccia utente dei messaggi di query.

source: Relations table bug fixes.
it: Correzioni di bug nella tabella delle relazioni.

source: We got Multi SQL Query support.
it: Abbiamo il supporto per query SQL multiple.

source: Ability to handle multiple SQL queries.
it: Possibilità di gestire query SQL multiple.

source: Execute the currently highlighted query.
it: Esegui la query attualmente evidenziata.

source: Improved Library Popover UI.
it: Interfaccia utente migliorata per il popover della libreria.

source: Use native GTK+ CSS attributes for better Light/Dark mode.
it: Utilizza gli attributi CSS GTK+ nativi per una migliore modalità Chiaro/Scuro.

source: Random UI improvements.
it: Miglioramenti casuali all'interfaccia utente.

source: Urgent! Fixed broken Tabs for translated version.
it: Urgente! Corrette le schede danneggiate per la versione tradotta.

source: Light and Dark Mode Switch!
it: Interruttore per la modalità chiara e scura!

source: Better Dark/Light mode switch in header bar.
it: Migliore interruttore per la modalità Chiaro/Scuro nella barra dell'intestazione.

source: Add Russian translation.
it: Aggiunta la traduzione russa.

source: Updated Welcome screen with New Window command.
it: Schermata di benvenuto aggiornata con il comando Nuova finestra.

source: Code cleanup.
it: Pulizia del codice.

source: Official Juno release!
it: Rilascio ufficiale di Juno!

source: Missing filter name on SQLite File Dialog.
it: Nome del filtro mancante nella finestra di dialogo del file SQLite.

source: We got Search!
it: Abbiamo la ricerca!

source: Search table names in sidebar.
it: Cerca i nomi delle tabelle nella barra laterale.

source: Fixes issue in connecting directly on a non saved connection.
it: Corregge il problema di connessione diretta a una connessione non salvata.

source: Updated Lithuanian translation.
it: Traduzione lituana aggiornata.

source: Improved Password Security.
it: Sicurezza delle password migliorata.

source: Safely store passwords in LibSecret.
it: Archivia le password in modo sicuro in LibSecret.

source: Auto upgrade on startup to remove passwords from GSettings.
it: Aggiornamento automatico all'avvio per rimuovere le password da GSettings.

source: Fixes issues with identical table names from other database in the same connection.
it: Corregge i problemi con nomi di tabelle identici da altri database nella stessa connessione.

source: Alphabetically ordered tables.
it: Tabelle ordinate alfabeticamente.

source: Improvements in showing MySql/MariaDB Table Structure.
it: Miglioramenti nella visualizzazione della struttura delle tabelle MySql/MariaDB.

source: Many more bugs for you to discover.
it: Molti altri bug da scoprire.

source: New Icon and Import/Export Library.
it: Nuova icona e libreria di importazione/esportazione.

source: Fancy new icon.
it: Nuova icona elegante.

source: Import and Export connections library.
it: Importa ed esporta la libreria delle connessioni.

source: Fixed random crash when opening and closing multiple connections.
it: Corretto l'arresto anomalo casuale all'apertura e chiusura di più connessioni.

source: Bug fixes and improvements.
it: Correzioni di bug e miglioramenti.

source: Fixed PostgreSQL Schema show options.
it: Corrette le opzioni di visualizzazione dello schema PostgreSQL.

source: Fixed crash on new connection dialog when opening the connection before saving.
it: Corretto l'arresto anomalo nella finestra di dialogo di nuova connessione quando si apre la connessione prima di salvarla.

source: Little side dish update.
it: Piccolo aggiornamento di contorno.

source: Fixed save window state on close.
it: Corretto il salvataggio dello stato della finestra alla chiusura.

source: Alternate coloured rows!
it: Righe colorate alternate!

source: Manually reload Content, Structure, and Relations.
it: Ricarica manualmente Contenuto, Struttura e Relazioni.

source: Show Table schema, content, and constraint relationships.
it: Mostra lo schema, il contenuto e le relazioni di vincolo della tabella.

source: Properly handle compound queries.
it: Gestisce correttamente le query composte.

source: Fix PostgreSQL table switch.
it: Corretto lo switch di tabella PostgreSQL.

source: Complete rewrite of the entire code base!
it: Riscritto completamente l'intero codice base!

source: Handle multiple Windows/Instances and multiple open connections.
it: Gestisce più finestre/istanze e più connessioni aperte.

source: Quicker response on big select queries
it: Risposta più rapida per le query select di grandi dimensioni

source: Better error handling.
it: Migliore gestione degli errori.

source: Better error handling, less crashes!
it: Migliore gestione degli errori, meno arresti anomali!

source: The app doesn't crash when dealing with big values
it: L'app non si arresta in modo anomalo quando si gestiscono valori di grandi dimensioni

source: Handling errors related to columns
it: Gestione degli errori relativi alle colonne

source: Some small clean up
it: Qualche piccola pulizia

source: Fixes issue with SQL Lite encrypted path
it: Corregge il problema con il percorso crittografato di SQL Lite

source: New Icon, Better error messages!
it: Nuova icona, messaggi di errore migliori!

source: New shiny icon
it: Nuova icona luccicante

source: View SQL error message on error
it: Visualizza il messaggio di errore SQL in caso di errore

source: FIX: Show proper PostgreSql Schema Table in Sidebar
it: CORREZIONE: Mostra la tabella dello schema PostgreSql corretta nella barra laterale

source: Snappiest query execution ever for local databases
it: Esecuzione di query più rapida di sempre per i database locali

source: The usual bundle of bugs for you to discover
it: Il solito pacchetto di bug da scoprire

source: Summoning the power of async methods!
it: Invochiamo il potere dei metodi asincroni!

source: All DataBase queries are now async methods, super fast.
it: Tutte le query del database sono ora metodi asincroni, super veloci.

source: The UI doesn't freeze anymore during a long process
it: L'interfaccia utente non si blocca più durante un processo lungo

source: Granite SourceList to display list of tables
it: Granite SourceList per visualizzare l'elenco delle tabelle

source: Tabs to switch between the Query Builder and the Table Structure
it: Schede per passare dal Query Builder alla Struttura della tabella

source: ComboBox to select table schemas from the open connection
it: ComboBox per selezionare gli schemi di tabella dalla connessione aperta

source: Many more bugs and issues for you to have fun with
it: Molti altri bug e problemi con cui divertirsi

source: Bug Fixes and Improvements
it: Correzioni di bug e miglioramenti

source: Display Table lists for SQLite and PostgreSQL
it: Visualizza gli elenchi delle tabelle per SQLite e PostgreSQL

source: Refresh Table List view if tables change
it: Aggiorna la visualizzazione dell'elenco delle tabelle se le tabelle cambiano

source: Removed unused GSettings
it: Rimossi GSettings inutilizzati

source: This is so good you won't believe it. New Library UI, Schema Table, Custom Port, and more
it: Questo è così buono che non ci crederai. Nuova interfaccia utente della libreria, tabella dello schema,porta personalizzata e altro ancora

source: A brand new Library View directly in your home screen, super tight and organized
it: Una nuovissima visualizzazione della libreria direttamente nella schermata iniziale, super compatta e organizzata

source: Custom Port field for those snazzy geeks who don't just use 3306
it: Campo Porta personalizzata per quei geek snazzy che non usano solo la 3306

source: A shiny new Sidebar View to list all your DataBase Tables
it: Una nuova e brillante visualizzazione della barra laterale per elencare tutte le tabelle del database

source: Code cleanup and speed improvements
it: Pulizia del codice e miglioramenti della velocità

source: Usual abundance of bugs and issues for you to have fun with!
it: La solita abbondanza di bug e problemi con cui divertirsi!

source: Major Update: Releasing a sweet table to view Query Results!
it: Aggiornamento principale: rilascio di una tabella fantastica per visualizzare i risultati delle query!

source: Did I say we got a sweet table to view query results?
it: Ho detto che abbiamo una fantastica tabella per visualizzare i risultati delle query?

source: New shortcut (ctrl+enter) to execute query
it: Nuova scorciatoia (ctrl+invio) per eseguire la query

source: Solved bug while connecting to DB directly from the Connection Dialog
it: Risolto il bug durante la connessione al database direttamente dalla finestra di dialogo di connessione

source: UI Improvements to Connection Dialog
it: Miglioramenti dell'interfaccia utente alla finestra di dialogo di connessione

source: Added Spanish and Lithuanian translations
it: Aggiunte le traduzioni in spagnolo e lituano

source: UI fixes
it: Correzioni dell'interfaccia utente

source: Visual improvements to the library view
it: Miglioramenti visivi alla visualizzazione della libreria

source: Initial Release
it: Rilascio iniziale

source: Store your Database connections
it: Archivia le tue connessioni al database

source: Quickly connect to a Local or Remote Database
it: Connettiti rapidamente a un database locale o remoto

source: Write SQL queries in the built-in code editor
it: Scrivi query SQL nell'editor di codice integrato

source: Database view
it: Visualizzazione database

source: New connection dialog
it: Finestra di dialogo nuova connessione
