Repository: ellie-commons/sequeler
Catalog: po/ars.po
Languages: ars

source: Directories are not supported
ars: المجلدات غير مدعومة

source: Don't know what to do
ars: ما أدري وش أسوي

source: Something completely unexpected happened
ars: صار شيء غير متوقع أبداً

source: Logout
ars: خروج

source: Light background
ars: خلفية فاتحة

source: Dark background
ars: خلفية غامقة

source: New Window
ars: نافذة جديدة

source: New Connection
ars: اتصال جديد

source: Quit
ars: إنهاء

source: Menu
ars: القائمة

source: Connected to %s
ars: متصل %s

source: SAVED CONNECTIONS
ars: اتصالات مخزنة

source: Delete All
ars: حذف الكل

source: Reload Library
ars: اعادة تحميل المكتبة

source: Export Library
ars: تصدير المكتبة

source: Are you sure you want to proceed?
ars: متأكد أنك ودك تكمل؟

source: By deleting this connection you won’t be able to recover this data.
ars: ترا لما تحذف هالاتصال ماراح تقدر ترجع بياناته.

source: Yes, Delete!
ars: ايه، احذف!

source: All the data will be deleted and you won’t be able to recover it.
ars: كل البيانات راح تنحذف وماراح تقدر ترجعها.

source: Yes, Delete All!
ars: ايه، احذف كل شي!

source: A username is required in order to connect!
ars: اسم المستخدم مطلوب عشان تقدر تتصل!

source: Pick a file
ars: اختر ملف

source: _Save
ars: _حفظ

source: _Cancel
ars: _الغاء

source: Unable to Connect to %s
ars: موب قادر يتصل ب %s

source: Unable to Export Library
ars: موب قادر يصدر المكنبة

source: Welcome to Sequeler
ars: حياك بتطبيق Sequeler

source: Connect to Any Local or Remote Database.
ars: اتصل بأي قاعدة محلية أو خارجية.

source: Add a New Database
ars: سوي قاعدة جديدة

source: Connect to a Database and Save It in Your Library
ars: اتصل بقاعدة وخزنها بمكتبتك

source: Open a New Sequeler Window
ars: افتح نافذة Sequeler جديدة

source: Import Connections
ars: استورد اتصالات

source: Import Previously Exported Sequeler Connections
ars: استورد اتصالات قد صدرتها قبل

source: Select a file
ars: حدد ملف

source: _Open
ars: _افتح

source: Unable to Import Library
ars: موب قادر يستورد مكتبة

source: Search Tables
ars: ابحث بالجداول

source: Search Tables…
ars: ابحث بالجداول…

source: Reload Tables
ars: اعادة تحميل الجداول

source: Add Table
ars: اضف جدول

source: - Select Database -
ars: - حدد قاعدة -

source: TABLES
ars: جداول

source: Structure
ars: البنية

source: Content
ars: المحتوى

source: Relations
ars: العلاقات

source: Query
ars: الاستعلام

source: Zoom Out
ars: سوي تصغير

source: Zoom 1:1
ars: خلي العرض طبيعي

source: Zoom In
ars: سوي تكبير

source: High Contrast
ars: سطوع عالي

source: Solarized Light
ars: شمسي فاتح

source: Solarized Dark
ars: شمسي غامق

source: Change Text Style
ars: غير شكل الكتابة

source: Create a new Query Tab
ars: سوي مبوبة استعلام جديدة

source: Query %i
ars: استعلام %i

source: Select Table
ars: حدد جدول

source: Select a table from the left sidebar to activate this view.
ars: جدد جدول من الجنب اليسار عشان تفعل العرض هذا.

source: No Results Available
ars: مافي أي نتايج متوفرة

source: Reload Results
ars: اعادة تحميل النتايج

source: Fields
ars: حقول

source: Previous Page
ars: الصفحة اللي قبل

source: Next Page
ars: الصفحة اللي بعده

source: %d Pages
ars: %d صفحات

source: Jump to page…
ars: انقز لصفحة…

source: 1 Page
ars: صفحة وحدة

source: %d of %d Pages
ars: %d من اصل %d صفحات

source: %d Entries
ars: %d ادخالات

source: Constraints
ars: قيود

source: Running Query…
ars: استعلام جالس يشتغل…

source: Export Results
ars: صدر النتايج

source: Export as CSV
ars: صدر بصيغة CSV

source: Export as Text
ars: صدر بصيغة نصية

source: Unable to process Query!
ars: موب قادر يشغل الاستعلام!

source: %d Total Results
ars: %d اجمالي النتايج

source: Query Successfully Executed! Rows Affected: %s
ars: الاستعلام تنفذ بشكل ممتاز! الصفوف اللي تأثرت: %s

source: Query Executed!
ars: الاستعلام تنفذ!

source: Run Query
ars: شغل استعلام

source: Connect
ars: اتصل

source: Edit Connection
ars: عدل اتصال

source: Duplicate Connection
ars: سوي اتصال مكرر من هذا

source: Delete Connection
ars: احذف الاتصال

source: Options
ars: خيارات

source: Error
ars: خطأ

source: on Column
ars: على العمود

source: Copy %s
ars: انسخ %s

source: %s (copy)
ars: %s (نسخة)

source: Libssh2 initialization failed (%d)
ars: فشل تشغيل Libssh2 (%d)

source: Failed to open socket
ars: منفذ السوكيت فشل فتحه

source: Failed to connect!
ars: فشل الاتصال!

source: Error when starting up SSH session: %d
ars: لما نحاول نبدأ جلسة SSH يطلع خطأ: %d

source: Authentication by password failed!
ars: عملية التحقق عن طريقة كلمة المرور فشلت!

source: Authentication by public key failed!
ars: عملية التحقق عن طريق الببلك كي فشلت!

source: No supported authentication methods found!
ars: مالقينا طرق تحقق مدعومة!

source: Failed to open listen socket
ars: فتح منفذ سوكيت للاستماع (listen socket ) فشلت

source: Failed to bind. Your Database Port may be wrong!
ars: الارتباط فشل! يمكن المنفذ حق القاعدة غلط!

source: Failed to listen!
ars: فشل بالاستماع!

source: Failed to accept remote connection!
ars: الموافقة على اتصال خارجي فشلت!

source: Could not open the direct-tcpip channel! (Note that this can be a problem at the server! Please review the server logs.)
ars: ماقدرنا نفتح قناة direct-tcpip! (ترا يمكن هذي مشكلة بالخادم نفسه! راجع لوقات السيرفر وشوف)

source: Error!
ars: خطأ!

source: Missing SSH Key file!
ars: مالقينا ملف SSH Key!

source: Missing SSH public key!
ars: مالقينا SSH public key!

source: Connection
ars: اتصال

source: Select connection color
ars: حدد لون للاتصال

source: Connection Name:
ars: اسم الاتصال:

source: Connection's name
ars: اسم الاتصال

source: Database Type:
ars: نوع القاعدة:

source: Host:
ars: المستضيف:

source: Database Name:
ars: اسم القاعدة:

source: Username:
ars: اسم المستخدم:

source: Password:
ars: كلمة المرور:

source: Show password
ars: اعرض كلمة المرور

source: Hide password
ars: خبي كلمة المرور

source: Port:
ars: المنفذ:

source: File Path:
ars: مسار الملف:

source: Select Your SQLite File…
ars: حدد الملف حق قاعدة SQLite…

source: Connect via SSH Tunnel:
ars: اتصال عن طريق SSH Tunnel:

source: SSH Host:
ars: مستضيف SSH:

source: SSH Username:
ars: اسم مستخدم SSH:

source: SSH Password:
ars: كلمة مرور SSH:

source: SSH Port:
ars: منفذ SSH:

source: Optional
ars: اختياري

source: SSH Identity
ars: هوية SSH (Identity)

source: Select Your Identity File…
ars: حدد ملف الهوية (Identity)…

source: Generate SSH Key
ars: سوي مفتاح SSH

source: SSH Tunnel
ars: قناة SSH (Tunnel)

source: Close
ars: اغلاق

source: Save Connection
ars: خزن الاتصال

source: Test Connection
ars: جرب الاتصال

source: Opening SSH Tunnel…
ars: جالس يفتح قناة SSH (Tunnel)…

source: Testing Connection…
ars: جالس يجرب الاتصال…

source: Successfully Connected!
ars: اتصل بشكل مضبوط!

source: Saving Connection…
ars: جالس يخزن الاتصال…

source: Connection Saved!
ars: الاتصال تخزن!

source: Connecting…
ars: جالس يتصل…
